package ru.liga.homework.util;

import lombok.extern.slf4j.Slf4j;
import org.springframework.stereotype.Component;

import java.util.*;
import java.util.regex.Matcher;
import java.util.regex.Pattern;
import java.util.stream.Collectors;

@Slf4j
@Component
public class ConvertTextToPreRevolution {
    private static final String REG_EXP_STRING = "[\\s,.:!?]+";

    private static final char EP = 0x44A;
    private static final String CONSONANTS_PATTERN = "[бпвфдтзсжшчцщгкхмнлрБПВФДТЗСЖШЧЦЩГКХМНЛР]$";
    private static final char I_DECIMAL = 0x456;
    private static final String I_DECIMAL_PATTERN = "[иИ]+[ауоыэяюёиеАУОЫЭЯЮЁИЕйЙ]";
    private static final char FITA = 0x472;
    private static final String SPACE = " ";
    private static final int INDX_FIRST = 0;
    private static final int INDX_LAST = 1;
    private static final Map<String, String> hashMapReplaceFITA = getHashMapFita();
    private static final Map<String, String> hashMapReplaceIATb = createHashMap();

    static {
        createHashMap();
        getHashMapFita();
    }

    public String convert(String text) {
        log.info("Start convert text {} to pre-revolution text", text);
        return addEP(replace_i_decimal(replaceFITAinUserName(replaceIATb(text))));
    }

    protected String addEP(String text) {
        log.debug("Convert text {}, add symbol {}", text, EP);
        List<String> listText = Arrays.asList(text.split(REG_EXP_STRING));
        Pattern pattern = Pattern.compile(CONSONANTS_PATTERN);

        return listText.stream()
                .map(s -> {
                    if (pattern.matcher(s).find()) {
                        s += EP;
                    }
                    return s;
                }).collect(Collectors.joining(SPACE));
    }

    protected String replace_i_decimal(String text) {
        log.debug("Convert text {}, replace 'и' on symbol {}", text, I_DECIMAL);
        List<String> listText = Arrays.asList(text.split(REG_EXP_STRING));
        Pattern pattern = Pattern.compile(I_DECIMAL_PATTERN);

        return listText.stream()
                .map(s -> {
                    Matcher matcher = pattern.matcher(s);
                    while (matcher.find()) {
                        s = s.substring(INDX_FIRST, matcher.start()) + I_DECIMAL + s.substring(matcher.start() + INDX_LAST);
                    }
                    return s;
                }).collect(Collectors.joining(SPACE));
    }


    protected String replaceFITAinUserName(String text) {
        log.debug("Convert text(name) {}, replace 'qp' on symbol {}", text, FITA);
        List<String> listText = Arrays.asList(text.split(REG_EXP_STRING));
        return listText.stream().map(
                s -> {
                    for (Map.Entry<String, String> entry : hashMapReplaceFITA.entrySet()
                    ) {
                        if (s.contains(entry.getKey())) {
                            s = entry.getValue();
                        }
                    }
                    return s;
                }
        ).collect(Collectors.joining(SPACE));
    }


    protected String replaceIATb(String text) {
        List<String> listText = Arrays.asList(text.split(REG_EXP_STRING));

        return listText.stream().map(
                s -> {
                    for (Map.Entry<String, String> entry : hashMapReplaceIATb.entrySet()
                    ) {
                        if (s.contains(entry.getKey())) {
                            s = s.substring(INDX_FIRST, s.indexOf(entry.getKey()))
                                    + entry.getValue() +
                                    s.substring(s.indexOf(entry.getKey()) + entry.getKey().length());
                        }
                    }
                    return s;
                }
        ).collect(Collectors.joining(SPACE));
    }

    private static Map<String, String> createHashMap() {
        return new HashMap<>() {
            {
                put("еда", "ѣда");
                put("ем", "ѣм");
                put("есть", "ѣсть");
                put("обед", "обѣд");
                put("обедня", "обѣдня");
                put("сыроежка", "сыроѣжка");
                put("сыроега", "сыроѣга");
                put("медведь", "медвѣдь");
                put("снедь", "снѣдь");
                put("едкий", "ѣдкий");
                put("ехать", "ѣхать");
                put("езда", "ѣзда");
                put("уезд", "уѣзд");
                put("еду", "ѣду");
                put("ездить", "ѣздить");
                put("поезд", "поѣзд");
                put("бег", "бѣг");
                put("беглец", "бѣглец");
                put("беженец", "бѣженец");
                put("забегаловка", "забѣгаловка");
                put("избегать", "избѣгать");
                put("избежать", "избѣжать");
                put("набег", "набѣг");
                put("перебежчик", "перебѣжчик");
                put("пробег", "пробѣг");
                put("разбег", "разбѣг");
                put("убежище", "убѣжище");
                put("центробежнаясила", "центробѣжная сила");
                put("беда", "бѣда");
                put("бедный", "бѣдный");
                put("победить", "побѣдить");
                put("убедить", "убѣдить");
                put("убеждение", "убѣждение");
                put("белый", "бѣлый");
                put("бельё", "бѣльё");
                put("белка", "бѣлка");
                put("бельмо", "бѣльмо");
                put("белуга", "бѣлуга");
                put("бес", "бѣс");
                put("бешеный", "бѣшеный");
                put("обет", "обѣт");
                put("обещать", "обѣщать");
                put("веять", "вѣять");
                put("веер", "вѣер");
                put("ветер", "вѣтер");
                put("ветвь", "вѣтвь");
                put("веха", "вѣха");
                put("ведать", "вѣдать");
                put("веди", "вѣди");
                put("весть", "вѣсть");
                put("повесть", "повѣсть ");
                put("ве́дение", "вѣ́дѣние");
                put("вежливый", "вѣжливый");
                put("невежда", "невѣжда");
                put("вежды", "вѣжды");
                put("вежа", "вѣжа");
                put("век", "вѣк");
                put("вечный", "вѣчный");
                put("увечить", "увѣчить");
                put("веко", "вѣко");
                put("венок", "вѣнок");
                put("вениквенок", "вѣниквѣнок");
                put("венец", "вѣнец");
                put("веник", "вѣник");
                put("вено", "вѣно");
                put("вера", "вѣра");
                put("вероятно", "вѣроятно");
                put("суеверие", "суевѣрие");
                put("вес", "вѣс");
                put("вешать", "вѣшать");
                put("повеса", "повѣса");
                put("равновесие", "равновѣсие");
                put("звезда", "звѣзда");
                put("зверь", "звѣрь");
                put("невеста", "невѣста");
                put("ответ", "отвѣт");
                put("совет", "совѣт");
                put("привет", "привѣт");
                put("завет", "завѣт");
                put("вещать", "вѣщать");
                put("вече", "вѣче");
                put("свежий", "свѣжий");
                put("свежеть", "свѣжѣть");
                put("свет", "свѣт");
                put("свеча", "свѣча");
                put("просвещение", "просвѣщение");
                put("светец", "свѣтец");
                put("светёлка", "свѣтёлка");
                put("Светлана", "Свѣтлана");
                put("цвет", "цвѣт");
                put("цветы", "цвѣты");
                put("цвести", "цвѣсти");
                put("человек", "человѣк");
                put("человеческий", "человѣческий");
                put("деть", "дѣть");
                put("девать", "дѣвать");
                put("одеть", "одѣть");
                put("одевать", "одѣвать");
                put("одеяло", "одѣяло");
                put("одеяние", "одѣяние");
                put("дело", "дѣло");
                put("делать", "дѣлать");
                put("действие", "дѣйствие");
                put("неделя", "недѣля");
                put("надеяться", "надѣяться");
                put("свидетель", "свидѣтель");
                put("дева", "дѣва");
                put("девочка", "дѣвочка");
                put("дед", "дѣд");
                put("делить", "дѣлить");
                put("предел", "предѣл");
                put("дети", "дѣти");
                put("детёныш", "дѣтёныш");
                put("детка", "дѣтка");
                put("детство", "дѣтство");
                put("зевать", "зѣвать");
                put("зев", "зѣв");
                put("ротозей", "ротозѣй");
                put("зело", "зѣло");
                put("зеница", "зѣница");
                put("зенки", "зѣнки");
                put("левый", "лѣвый");
                put("левша", "лѣвша");
                put("лезть", "лѣзть");
                put("лестница", "лѣстница");
                put("облезлый", "облѣзлый");
                put("лекарь", "лѣкарь");
                put("лечить", "лѣчить");
                put("лекарство", "лѣкарство");
                put("лень", "лѣнь");
                put("ленивец", "лѣнивец");
                put("ленивый", "лѣнивый");
                put("лентяй", "лѣнтяй");
                put("лепота", "лѣпота");
                put("великолепный", "великолѣпный");
                put("лепить", "лѣпить");
                put("нелепый", "нелѣпый");
                put("слепок", "слѣпок");
                put("лес", "лѣс");
                put("лесник", "лѣсник");
                put("лесничий", "лѣсничий");
                put("лесопилка", "лѣсопилка");
                put("леший", "лѣший");
                put("лето", "лѣто");
                put("долголетие", "долголѣтие");
                put("Летов", "Лѣтов");
                put("летоисчисление", "лѣтоисчисление");
                put("летописец", "лѣтописец");
                put("летопись", "лѣтопись");
                put("малолетка", "малолѣтка");
                put("однолетка", "однолѣтка");
                put("пятилетка", "пятилѣтка");
                put("совершеннолетие", "совершеннолѣтие");
                put("леха́", "лѣха́");
                put("бледный", "блѣдный");
                put("железо", "желѣзо");
                put("железняк", "желѣзняк");
                put("калека", "калѣка");
                put("калечить", "калѣчить");
                put("клеть", "клѣть");
                put("клетка", "клѣтка");
                put("колено", "колѣно");
                put("наколенник", "наколѣнник");
                put("поколение", "поколѣние");
                put("лелеять", "лелѣять");
                put("млеть", "млѣть");
                put("плен", "плѣн");
                put("пленённый", "плѣнённый");
                put("пленить", "плѣнить");
                put("пленник", "плѣнник");
                put("плесень", "плѣсень");
                put("плешь", "плѣшь");
                put("Плеханов", "Плѣханов");
                put("полено", "полѣно");
                put("след", "слѣд");
                put("последователь", "послѣдователь");
                put("последствие", "послѣдствие");
                put("преследовать", "преслѣдовать");
                put("следить", "слѣдить");
                put("следопыт", "слѣдопыт");
                put("слепой", "слѣпой");
                put("телега", "телѣга");
                put("тележный", "телѣжный");
                put("тлен", "тлѣн");
                put("тление", " тлѣние");
                put("тленный", "тлѣнный");
                put("хлеб", "хлѣб");
                put("хлев", "хлѣв");
                put("медь", "мѣдь");
                put("медный", "мѣдный");
                put("мел", "мѣл");
                put("менять", "мѣнять");
                put("изменник", "измѣнник");
                put("непременно", "непремѣнно");
                put("мера", "мѣра");
                put("намерение", "намѣрение");
                put("лицемер", "лицемѣр");
                put("месяц", "мѣсяц");
                put("месить", "мѣсить");
                put("мешать", "мѣшать");
                put("помеха", "помѣха");
                put("место", "мѣсто");
                put("мещанин", "мѣщанин");
                put("помещик", "помѣщик");
                put("наместник", "намѣстник");
                put("метить", "мѣтить");
                put("замечать", "замѣчать");
                put("примечание", "примѣчание");
                put("сметить", "смѣтить");
                put("смета", "смѣта");
                put("мех", "мѣх");
                put("мешок", "мѣшок");
                put("змей", "змѣй");
                put("змея", "змѣя");
                put("сметь", "смѣть");
                put("смелый", "смѣлый");
                put("смеяться", "смѣяться");
                put("смех", "смѣх");
                put("нега", "нѣга");
                put("нежный", "нѣжный");
                put("нежить", "нѣжить");
                put("недра", "нѣдра");
                put("внедрить", "внѣдрить");
                put("немой", "нѣмой");
                put("немец", "нѣмец");
                put("нет", "нѣт");
                put("отнекаться", "отнѣкаться");
                put("гнев", "гнѣв");
                put("гнедой", "гнѣдой");
                put("гнездо", "гнѣздо");
                put("загнетка", "загнѣтка");
                put("снег", "снѣг");
                put("снежный", "снѣжный");
                put("мнение", "мнѣние");
                put("сомнение", "сомнѣние");
                put("сомневаться", "сомнѣваться");
                put("петь", "пѣть");
                put("песня", "пѣсня");
                put("петух", "пѣтух");
                put("пегий", "пѣгий");
                put("пена", "пѣна");
                put("пенязь", "пѣнязь");
                put("пестовать", "пѣстовать");
                put("пестун", "пѣстун");
                put("пехота", "пѣхота");
                put("пеший", "пѣший");
                put("опешить", "опѣшить");
                put("спеть", "спѣть");
                put("спех", "спѣх");
                put("спешить", "спѣшить");
                put("успех", "успѣх");
                put("реять", "рѣять");
                put("река", "рѣка");
                put("речь", "рѣчь");
                put("наречие", "нарѣчие");
                put("редкий", "рѣдкий");
                put("редька", "рѣдька");
                put("резать", "рѣзать");
                put("резвый", "рѣзвый");
                put("репа", "рѣпа");
                put("репица", "рѣпица");
                put("ресница", "рѣсница");
                put("обретать", "обрѣтать");
                put("обрести", "обрѣсти");
                put("сретение", "срѣтение");
                put("встречать", "встрѣчать");
                put("прореха", "прорѣха");
                put("решето", "рѣшето");
                put("решётка", "рѣшётка");
                put("решать", "рѣшать");
                put("решить", "рѣшить");
                put("грех", "грѣх");
                put("грешный", "грѣшный");
                put("зреть", "зрѣть");
                put("созреть", "созрѣть");
                put("зрелый", "зрѣлый");
                put("зрение", "зрѣние");
                put("крепкий", "крѣпкий");
                put("крепиться", "крѣпиться");
                put("орех", "орѣх");
                put("преть", "прѣть");
                put("прелый", "прѣлый");
                put("прение", "прѣние");
                put("пресный", "прѣсный");
                put("свирепый", "свирѣпый");
                put("свирель", "свирѣль");
                put("стрела", "стрѣла");
                put("стрелять", "стрѣлять");
                put("стреха", "стрѣха");
                put("застреха", "застрѣха");
                put("хрен", "хрѣн");
                put("сусек", "сусѣк");
                put("сеять", "сѣять");
                put("семя", "сѣмя");
                put("север", "сѣвер");
                put("седло", "сѣдло");
                put("сесть", "сѣсть");
                put("беседа", "бесѣда");
                put("сосед", "сосѣд");
                put("седой", "сѣдой");
                put("седеть", "сѣдѣть");
                put("секу", "сѣку");
                put("сечь", "сѣчь");
                put("сеча", "сѣча");
                put("сечение", "сѣчение");
                put("просека", "просѣка");
                put("насекомое", "насѣкомое");
                put("сень", "сѣнь");
                put("осенять", "осѣнять");
                put("сени", "сѣни");
                put("сено", "сѣно");
                put("серый", "сѣрый");
                put("сера", "сѣра");
                put("посетить", "посѣтить");
                put("посещать", "посѣщать ");
                put("сетовать", "сѣтовать");
                put("сеть", "сѣть");
                put("сетка", "сѣтка");
                put("стена", "стѣна");
                put("застенок", "застѣнок");
                put("застенчивый", "застѣнчивый");
                put("стенгазета", "стѣнгазета");
                put("тело", "тѣло");
                put("мягкотелость", "мягкотѣлость");
                put("растелешиться", "растѣлешиться");
                put("тельняшка", "тѣльняшка");
                put("тень", "тѣнь");
                put("оттенок", "оттѣнок");
                put("тенёк", "тѣнёк");
                put("тесто", "тѣсто");
                put("тесный", "тѣсный");
                put("стеснять", "стѣснять");
                put("стесняться", "стѣсняться");
                put("теснить", "тѣснить");
                put("тесниться", "тѣсниться");
                put("затеять", "затѣять");
                put("затея", "затѣя");
                put("утеха", "утѣха");
                put("потеха", "потѣха");
                put("тешить", "тѣшить");
                put("утешение", "утѣшение");
                put("хер", "хѣр");
                put("похерить", "похѣрить");
                put("цевка", "цѣвка");
                put("цевье", "цѣвье");
                put("цевница", "цѣвница");
                put("цедить", "цѣдить");
                put("целый", "цѣлый");
                put("исцелять", "исцѣлять");
                put("целовать", "цѣловать");
                put("поцелуй", "поцѣлуй");
                put("цель", "цѣль");
                put("целиться", "цѣлиться");
                put("цена", "цѣна");
                put("цепь", "цѣпь");
                put("цеплять", "цѣплять");
                put("цеп", "цѣп");
            }
        };
    }

    private static Map<String, String> getHashMapFita() {
        return new HashMap<>() {{
            put("агафья", "Агаѳья");
            put("Агафья", "Агаѳья");
            put("Анфим", "Анѳим");
            put("анфим", "Анѳим");
            put("Aфанасий", "Аѳанасий");
            put("афанасий", "Аѳанасий");
            put("Афина", "Аѳина");
            put("афина", "Аѳина");
            put("Варфоломей", "варѳоломей");
            put("варфоломей", "варѳоломей");
            put("Голиаф", "Голиаѳ");
            put("голиаф", "Голиаѳ");
            put("Евфимий", "Евѳимий");
            put("евфимий", "Евѳимий");
            put("Марфа", "Марѳа");
            put("марфа", "Марѳа");
            put("Матфей", "Матѳей");
            put("матфей", "Матѳей");
            put("Мефодий", "Меѳодий");
            put("мефодий", "Меѳодий");
            put("Нафанаил", "Наѳанаил");
            put("нафанаил", "Наѳанаил");
            put("Парфенон", "Парѳенон");
            put("парфенон", "Парѳенон");
            put("Пифагор", "Пиѳагор");
            put("пифагор", "Пиѳагор");
            put("Руфь", "Руѳь");
            put("руфь", "Руѳь");
            put("саваоф", "Саваоѳ");
            put("Саваоф", "Саваоѳ");
            put("Тимофей", "Тимоѳей");
            put("тимофей", "Тимоѳей");
            put("Эсфирь", "Эсѳирь");
            put("эсфирь", "Эсѳирь");
            put("Иудифь", "Иудиѳь");
            put("иудифь", "Иудиѳь");
            put("Фаддей", "Ѳаддей");
            put("фаддей", "Ѳаддей");
            put("Фекла", "Ѳекла");
            put("фекла", "Ѳекла");
            put("Фемида", "Ѳемида");
            put("фемида", "Ѳемида");
            put("Фемистокл", "Ѳемистокл");
            put("фемистокл", "Ѳемистокл");
            put("Феодор", "Ѳеодор");
            put("феодор", "Ѳеодор");
            put("Фёдор", "Ѳёдор");
            put("фёдор", "Ѳёдор");
            put("федя", "Ѳедя");
            put("Федя", "Ѳедя");
            put("феодосий", "Ѳеодосий");
            put("Феодосий", "Ѳеодосий");
            put("Федосий", "Ѳедосий");
            put("федосий", "Ѳедосий");
            put("Феодосия", "Ѳеодосия");
            put("феодосия", "Ѳеодосия");
            put("Феодот", "Ѳеодот");
            put("феодот", "Ѳеодот");
            put("Федот", "Ѳедот");
            put("федот", "Ѳедот");
            put("Феофан", "Ѳеоѳан");
            put("феофан", "Ѳеоѳан");
            put("Феофил", "Ѳеоѳил");
            put("феофил", "Ѳеоѳил");
            put("ферапонт", "Ѳерапонт");
            put("Ферапонт", "Ѳерапонт");
            put("Фома", "Ѳома");
            put("фома", "Ѳома");
            put("Фоминична", "Ѳоминична");
            put("фоминична", "Ѳоминична");
        }};
    }
}